mcheah/Marlin4MPMD/MPMD_3dPrinter/Drivers/BSP/STM32F0xx-3dPrinter/stm32f0xx_3dprinter_cdc.c
/**
  ******************************************************************************
  * @file    stm32f0xx_3dPrinter_cdc.c
  * @author  IPC Rennes
  * @version V1.0.0
  * @date    January 29, 2015
  * @brief   uart functions of 3D Printer BSP driver 
  *  (based on L6474)
  * @note    (C) COPYRIGHT 2015 STMicroelectronics
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_3dprinter_cdc.h"
#include "stm32f0xx_3dprinter_misc.h"
// #include "stm32f0xx_3dprinter_wifi.h"
#include <string.h> /* for memcpy */
#include <stdarg.h> /* for va_start */
#include <stdio.h> /* for vsprintf */
#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_cdc.h"
#include "usbd_cdc_interface.h"
#include "stm32f0xx_mpmd.h"
/* Private defines -----------------------------------------------------------*/
/* Private constant ----------------------------------------------------------*/

#ifdef USE_XONXOFF
#define BSP_CDC_GET_NB_BYTES_IN_RX_BUFFER()  ((gBspUartData.pRxReadBuffer <= gBspUartData.pRxWriteBuffer)? \
                                    ( (unsigned int )(gBspUartData.pRxWriteBuffer - gBspUartData.pRxReadBuffer)): \
                                    ( (unsigned int )(gBspUartData.pRxWriteBuffer + UART_RX_BUFFER_SIZE - gBspUartData.pRxReadBuffer)))


#define BSP_CDC_GET_NB_BYTES_IN_TX_BUFFER()  ((gBspUartData.pTxReadBuffer <= gBspUartData.pTxWriteBuffer)? \
                                    ( (unsigned int )(gBspUartData.pTxWriteBuffer - gBspUartData.pTxReadBuffer)): \
                                    ( (unsigned int )(gBspUartData.pTxWriteBuffer + UART_TX_BUFFER_SIZE - gBspUartData.pTxReadBuffer)))


#define BSP_CDC_TX_THRESHOLD_XOFF  (UART_TX_BUFFER_SIZE / 50)
#define BSP_CDC_TX_THRESHOLD_XON   (UART_TX_BUFFER_SIZE / 100)
#define BSP_CDC_RX_THRESHOLD_XOFF  (UART_RX_BUFFER_SIZE / 2)
#define BSP_CDC_RX_THRESHOLD_XON   (UART_RX_BUFFER_SIZE / 3)
#endif

/* Private functions ---------------------------------------------------------*/


/* Global variables ----------------------------------------------------------*/
volatile USBD_HandleTypeDef USBD_Device;
//BspUartDataType gBspUartData;
volatile uint8_t gBspCdcTxBuffer[2 * CDC_TX_BUFFER_SIZE]; // real size is double to easily handle memcpy and tx uart
volatile uint8_t gBspCdcRxBuffer[2 * CDC_RX_BUFFER_SIZE];

volatile uint8_t rxWriteChar;
volatile uint8_t *pRxBuffer = gBspCdcRxBuffer;
volatile uint8_t *pRxWriteBuffer;
volatile uint8_t *pRxReadBuffer;
uint32_t debugNbRxFrames = 0;
uint32_t debugNbTxFrames = 0;
#ifdef USE_XONXOFF
static uint8_t BspUartXonXoff = 0;
static uint8_t BspUartXoffBuffer[12] = " SEND XOFF\n";
static uint8_t BspUartXonBuffer[11] = " SEND XON\n";
#endif
/* Extern function -----------------------------------------------------------*/

/******************************************************//**
 * @brief  Usart Hw initialisation
 * @param None
 * @retval None
 **********************************************************/
void BSP_CdcHwInit(uint32_t newBaudRate)
{
  /* Init Device Library */
  USBD_Init(&USBD_Device, &VCP_Desc, 0);

  /* Add Supported Class */
  USBD_RegisterClass(&USBD_Device, &USBD_CDC);

  /* Add CDC Interface Class */
  USBD_CDC_RegisterInterface(&USBD_Device, &USBD_CDC_fops);
}

/******************************************************//**
 * @brief  Start the UART interface with the GUI 
 * @param None
 * @retval None
 **********************************************************/

void BSP_CdcIfStart(void)
{
  /* Start Device Process */
  USBD_Start(&USBD_Device);
  pRxWriteBuffer =  pRxBuffer;
  pRxReadBuffer =  pRxBuffer;
  debugNbTxFrames = 0;
  debugNbRxFrames = 0;
//Delay to allow connection before trying to send data
  HAL_Delay(5000);
}

/******************************************************//**
 * @brief  Queue tx data to be sent on the UART
 * @param[in]  pBuf pointer to the data to be sent
 * @param[in]  nbData number of bytes to be sent
 * @retval None
 **********************************************************/
void BSP_CdcIfQueueTxData(uint8_t *pBuf, uint8_t nbData)
{
    if(nbData) {
    	uint32_t Len = nbData;
    	CDC_Itf_QueueTxBytes(pBuf, Len);
    }
}
   
/******************************************************//**
 * @brief  Send queued data to the GUI
 * @param None
 * @retval None
 **********************************************************/
void BSP_CdcIfSendQueuedData()
{
	while(BSP_CdcIsTxOnGoing()) { BSP_LED_On(LED_GREEN); }
	BSP_LED_Off(LED_RED);
}

/******************************************************//**
 * @brief  Tx Transfer completed callback
 * @param[in] UartHandle UART handle. 
 * @retval None
 **********************************************************/


/******************************************************//**
 * @brief  Rx Transfer completed callback
 * @param[in] UartHandle UART handle. 
 * @retval None
 **********************************************************/
void BSP_CDC_RxCpltCallback(uint8_t* Buf, uint32_t *Len)
{
	//Copy character by character to avoid wraparound issues
	for(uint32_t i=0;i<*Len;i++)
	{
	    *pRxWriteBuffer = Buf[i];
	    pRxWriteBuffer++;
		//Wrap back to 0
	    if (pRxWriteBuffer >= (pRxBuffer + CDC_RX_BUFFER_SIZE)) {
	      pRxWriteBuffer = pRxBuffer;
	    }
	    if (pRxWriteBuffer == pRxReadBuffer) {
	      // Rx buffer is full
	      CDC_ERROR(7);
	    }
	    debugNbRxFrames++;
	}
}

/******************************************************//**
 * @brief  Uart Error callback
 * @param[in] UartHandle UART handle. 
 * @retval None
 **********************************************************/

/******************************************************//**
 * @brief  This function trigs the transmission of a string over the UART 
 *             for printing
 * @param[in] format string with formatting
 * @param[in]  Optional arguments to fit with formatting
 * @retval Lengthj of the string to print (uint32_t)
 **********************************************************/
uint32_t BSP_CdcPrintf(const char* format,...)
{
  va_list args;
  uint32_t size;
  uint32_t retSize = 0;
  char *writeBufferp = gBspCdcTxBuffer;
  /* the string to transmit is copied in the temporary buffer in order to    */
  /* check its size.                                                         */
  va_start(args, format);
  size=vsprintf(writeBufferp, (const char*)format, args);
  va_end(args);
   
  retSize = size;   
  if (*(writeBufferp + size - 1) == '\n')
  {
    *(writeBufferp + size - 1) = '\r';
    *(writeBufferp + size) = '\n';
    size++;
  }
  if (size != 0) {
    if ( size > CDC_TX_BUFFER_SIZE ) {
      CDC_ERROR(9);
    }
    CDC_Itf_QueueTxBytes(writeBufferp,size);
  }
  return(retSize);  
}

/******************************************************//**
 * @brief  This function returns the number of bytes received via the UART
 * @param[in] fnone
  * @retval nxRxBytes nb received bytes
 **********************************************************/
uint32_t BSP_CdcGetNbRxAvalaibleBytes(void)
{
  uint8_t *writePtr = (uint8_t *)(pRxWriteBuffer - 1);
  
  if (writePtr < pRxBuffer)
  {
    writePtr += CDC_RX_BUFFER_SIZE;
  }  
  
  //waitline feed to have a complete line before processing bytes
  if ((*writePtr) != '\r' && (*writePtr) != '\n')
    return (0);
  
  int32_t nxRxBytes = pRxWriteBuffer - pRxReadBuffer;
  if (nxRxBytes < 0)  {
    nxRxBytes += CDC_RX_BUFFER_SIZE;
  }
  return ((uint32_t) nxRxBytes );
}

/******************************************************//**
 * @brief  This function returns the first byte available on the UART
 * @param[in] none
 * @retval byteValue (0-0X7F)  or -1 if no byte is available
 **********************************************************/
int8_t BSP_CdcGetNextRxBytes(void)
{
  int8_t byteValue;

  uint8_t *writePtr = (uint8_t *)(pRxWriteBuffer);
  
  if (writePtr < pRxBuffer)  {
    writePtr += CDC_RX_BUFFER_SIZE;
  }  
  
  if (pRxReadBuffer != writePtr)  {
    byteValue = (int8_t)(*(pRxReadBuffer));
    pRxReadBuffer++;

    if (pRxReadBuffer >= (pRxBuffer + CDC_RX_BUFFER_SIZE))    {
      pRxReadBuffer = pRxBuffer;
    } 
  }
  else  {
    byteValue = -1;
  }
  
  return (byteValue);
}

/******************************************************//**
 * @brief  Returns if there is a pending TX request in the UART
 * @param[in] none
 * @retval 0 if no pending TX request in the UART
 **********************************************************/
uint8_t BSP_CdcIsTxOnGoing(void)
{
	return !CDC_Itf_IsTxQueueEmpty();
}

/******************************************************//**
 * @brief  This function sends data via the Uart in locking
 * mode (no interrupt used).
 * It should not be used except by the Error handler
 * @param[in]  pBuf pointer to the data to be sent
 * @param[in]  nbData number of bytes to be sent
 * @retval None
 **********************************************************/

void BSP_CdcLockingTx(uint8_t *pBuf, uint8_t nbData)
{
	CDC_Itf_QueueTxBytes(pBuf,nbData);
	BSP_CdcIfSendQueuedData();
}
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

